#pragma once

#include "lib_def.h"
#include "type.h"

LIB_KATA_BEGIN

// PIとe
static const f32 PI			= 3.1415926535897932384626433832795f;     //!< πです.
static const f32 PI_2		= 6.283185307179586476925286766559f;      //!< 2πです.
static const f32 DIV_1_PI	= 0.31830988618379067153776752674503f;    //!< 1/πです.
static const f32 PI_DIV2	= 1.5707963267948966192313216916398f;     //!< π/2です.
static const f32 PI_DIV3	= 1.0471975511965977461542144610932f;     //!< π/3です.
static const f32 PI_DIV4	= 0.78539816339744830961566084581988f;    //!< π/4です.
static const f32 PI_DIV6	= 0.52359877559829887307710723054658f;    //!< π/6です.
static const f32 EPSILON	= 1.192092896e-07f;                       //!< マシンイプシロン(float).

//--------------------------------------------------------------------------------------------------
//! @brief      度をラジアンに変換します.
//!
//! @param [in]     degree      角度(度)
//! @return     度をラジアンに変換した結果を返却します.
//--------------------------------------------------------------------------------------------------
inline static f32     ToRadian(f32 _degree) { return _degree * PI / 180.0f; }

//--------------------------------------------------------------------------------------------------
//! @brief      ラジアンを度に変換します.
//!
//! @param [in]     radian      角度(ラジアン)
//! @return     ラジアンを度に変換した結果を返却します.
//--------------------------------------------------------------------------------------------------
inline static f32     ToDegree( f32 _radian ) { return _radian / PI * 180.0f; }

LIB_KATA_END